Revit 2027 API
DockablePane.IsShown Method
 Identify the pane is currently visible or in a tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShown()
Public Function IsShown As Boolean
public:
bool IsShown()
member IsShown : unit -> bool
Return Value
Boolean
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace